Terraform plan for __production__
<details>
  <summary>Plan: 15 to add, 1 to change, 15 to destroy. Changes to Outputs.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_route53_zone.zone[0] must be replaced
-/+ resource "aws_route53_zone" "zone" {
      ~ id            = "*********************" -> (known after apply)
      ~ name          = "ssb.datagov.us." -> "ssb.data.gov" # forces replacement
      ~ name_servers  = [
          - "ns-1147.awsdns-15.org",
          - "ns-1786.awsdns-31.co.uk",
          - "ns-28.awsdns-03.com",
          - "ns-658.awsdns-18.net",
        ] -> (known after apply)
      - tags          = {} -> null
      + vpc_id        = (known after apply)
      + vpc_region    = (known after apply)
      ~ zone_id       = "*********************" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # cloudfoundry_service_instance.k8s_cluster will be updated in-place
  ~ resource "cloudfoundry_service_instance" "k8s_cluster" {
        id                             = "0f63f2ee-c912-4430-8896-1815c0428d84"
        name                           = "ssb-k8s"
      ~ service_plan                   = "5e907692-7298-420c-9464-4a79f61061d7" -> (known after apply)
        tags                           = [
            "k8s",
        ]
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.broker_aws.data.archive_file.app_zip will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "app_zip"  {
      ~ id                  = "****************************************" -> (known after apply)
      ~ output_base64sha256 = "jDnsF3nzE8ih8Cp/CFLPXfftHJwdOtSBbIQN1u5Regs=" -> (known after apply)
      ~ output_md5          = "75c7d8f95d99bd2ffeca2218126c51a5" -> (known after apply)
      ~ output_sha          = "a3522bcca749f305f1ea129752e5898788880b73" -> (known after apply)
      ~ output_size         = 136879275 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.broker_aws.data.cloudfoundry_domain.apps will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_domain" "apps"  {
      ~ domain     = "cloud.gov" -> (known after apply)
      ~ id         = "************************************" -> (known after apply)
      ~ internal   = false -> (known after apply)
      ~ name       = "app.cloud.gov" -> (known after apply)
      + org        = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.broker_aws.data.cloudfoundry_service.rds will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_service" "rds"  {
      ~ id                  = "************************************" -> (known after apply)
        name                = "aws-rds"
      ~ service_broker_name = "aws-broker" -> (known after apply)
      ~ service_plans       = {
          - "large-gp-mysql"            = "399ebbb8-ab37-4883-bb7b-0467e66aa8f0"
          - "large-gp-mysql-redundant"  = "3cfd191c-809a-40b1-93c7-37f2f07ec151"
          - "large-gp-psql"             = "639ae8c5-7605-476d-ae55-cfc58f46c6d7"
          - "large-gp-psql-redundant"   = "7eab29c9-e690-4c98-9f78-07cde05b2904"
          - "medium-gp-mysql"           = "f2d7b4af-16e5-4504-8cf9-c1be5d3c81bc"
          - "medium-gp-mysql-redundant" = "f6e176ec-d093-42f7-80e8-2bbacbab450d"
          - "medium-gp-psql"            = "815c6069-289a-4444-ba99-40f0fa03a8f5"
          - "medium-gp-psql-redundant"  = "c1ddc2d6-983b-4ced-9995-064d9dde07aa"
          - "medium-mysql"              = "adf004d9-54b6-40e8-ae6a-56ee985a646c"
          - "medium-mysql-redundant"    = "8bfe6ea3-d8b1-4495-8b4c-5aba9c529f4c"
          - "medium-oracle-se2"         = "601b6c2b-2bac-42a0-84c4-4cb841c34deb"
          - "medium-psql"               = "d8af8c96-8cfd-455f-8660-35a029fec110"
          - "medium-psql-redundant"     = "2fb989d0-4097-4726-9877-88c44fa7a622"
          - "micro-psql"                = "5ed9f319-4c75-4851-9885-598a96b7febc"
          - "micro-psql-redundant"      = "ad7461b3-cb73-4859-a660-477993f85f6f"
          - "shared-mysql"              = "3a8e624f-ba5a-4435-8fa4-ee955b103bae"
          - "shared-psql"               = "64a259ed-01ab-4cdb-ace3-14fc7bde4ab6"
          - "small-mysql"               = "88663dbc-92c9-4b40-9f07-fb4788436fc5"
          - "small-mysql-redundant"     = "4b9e5bb1-d0d3-4c24-8542-e377cbb85aed"
          - "small-psql"                = "903c65ce-6c2b-420f-ad7d-a94ac4d52e93"
          - "small-psql-redundant"      = "731eb930-81ea-4a03-82f2-a187d8339d14"
          - "xlarge-gp-mysql"           = "1f44135c-64a8-44fc-bc61-539f126cdb78"
          - "xlarge-gp-mysql-redundant" = "2ed298b8-a7b5-400a-b2f1-c8198423c861"
          - "xlarge-gp-psql"            = "0fd6a750-0860-4c48-a5ea-fdce04500e23"
          - "xlarge-gp-psql-redundant"  = "58b899e8-eb36-441f-b406-d2f5b1e49c00"
        } -> (known after apply)
    }

  # module.broker_aws.data.cloudfoundry_space.broker_space will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "broker_space"  {
      - annotations = {} -> null
      ~ id          = "************************************" -> (known after apply)
      - labels      = {} -> null
        name        = "management"
      ~ org         = "90047c5d-337f-4802-bd48-2149a4265040" -> (known after apply)
      + quota       = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.broker_aws.data.cloudfoundry_space.spaces["gsa-datagov/development"] will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "spaces"  {
      - annotations = {} -> null
      ~ id          = "************************************" -> (known after apply)
      - labels      = {} -> null
        name        = "development"
      ~ org         = "90047c5d-337f-4802-bd48-2149a4265040" -> (known after apply)
      + quota       = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.broker_aws.data.cloudfoundry_space.spaces["gsa-datagov/management"] will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "spaces"  {
      - annotations = {} -> null
      ~ id          = "************************************" -> (known after apply)
      - labels      = {} -> null
        name        = "management"
      ~ org         = "90047c5d-337f-4802-bd48-2149a4265040" -> (known after apply)
      + quota       = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.broker_aws.data.cloudfoundry_space.spaces["gsa-datagov/prod"] will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "spaces"  {
      - annotations = {} -> null
      ~ id          = "************************************" -> (known after apply)
      - labels      = {} -> null
        name        = "prod"
      ~ org         = "90047c5d-337f-4802-bd48-2149a4265040" -> (known after apply)
      + quota       = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.broker_aws.data.cloudfoundry_space.spaces["gsa-datagov/staging"] will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "spaces"  {
      - annotations = {} -> null
      ~ id          = "************************************" -> (known after apply)
      - labels      = {} -> null
        name        = "staging"
      ~ org         = "90047c5d-337f-4802-bd48-2149a4265040" -> (known after apply)
      + quota       = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.broker_aws.cloudfoundry_app.ssb must be replaced
-/+ resource "cloudfoundry_app" "ssb" {
      ~ environment                = (sensitive value)
      + health_check_http_endpoint = (known after apply)
      ~ health_check_timeout       = 0 -> (known after apply)
      ~ id                         = "************************************" -> (known after apply)
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-aws"
      ~ ports                      = [
          - 8080,
        ] -> (known after apply)
      ~ source_code_hash           = "jDnsF3nzE8ih8Cp/CFLPXfftHJwdOtSBbIQN1u5Regs=" -> (known after apply)
      ~ space                      = "9a1db116-0180-42be-8ffa-7944dcf6bf50" -> (known after apply) # forces replacement
      ~ stack                      = "ad34309f-ab24-4c3d-9ad1-eb0da8378bd4" -> (known after apply)
        # (11 unchanged attributes hidden)

      - routes {
          - port  = 8080 -> null
          - route = "c8f4d632-cb0e-4003-b247-b128ef566145" -> null
        }
      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }

      ~ service_binding {
          - params           = (sensitive value)
          ~ service_instance = "977a240a-080b-42ab-bc39-459231ac4449" -> (known after apply)
        }
    }

  # module.broker_aws.cloudfoundry_route.ssb_uri must be replaced
-/+ resource "cloudfoundry_route" "ssb_uri" {
      ~ domain   = "50ba3f69-cd54-4963-9172-14f3334b479e" -> (known after apply) # forces replacement
      ~ endpoint = "ssb-aws-gsa-datagov-management.app.cloud.gov" -> (known after apply)
      ~ id       = "************************************" -> (known after apply)
      + port     = (known after apply)
      ~ space    = "9a1db116-0180-42be-8ffa-7944dcf6bf50" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.broker_aws.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/development"] must be replaced
-/+ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_hash                     = "53HUIGos3LnoL6VoQubUuNGmNJw=" -> (known after apply)
      ~ id                               = "************************************" -> (known after apply)
        name                             = "ssb-aws-gsa-datagov-development"
      ~ service_plans                    = {
          - "csb-aws-dynamodb/ondemand"     = "7b84fe6d-d5c8-4928-9517-d9df8b8c6d40"
          - "csb-aws-dynamodb/provisioned"  = "cdd5fc10-2847-47eb-9dc0-487d5cd693f6"
          - "csb-aws-mysql/large"           = "a5cd2622-caed-40e9-a55e-c8790c074b8d"
          - "csb-aws-mysql/medium"          = "c062689f-e7ad-42c9-8256-e2afba2d889a"
          - "csb-aws-mysql/small"           = "7cbe04f7-cd76-41ce-a2a1-a31996f107e6"
          - "csb-aws-postgresql/large"      = "91491598-e399-44ed-b9f0-542a457f0c7f"
          - "csb-aws-postgresql/medium"     = "5aa4cc22-88f7-4b83-83f2-ec84994d3a27"
          - "csb-aws-postgresql/small"      = "f4c577e6-21d1-4006-a5c9-f22ce1a7d351"
          - "csb-aws-postgresql/subsume"    = "e9d005c3-eeb9-466b-a8da-8f1a20474c22"
          - "csb-aws-redis/large"           = "1ff684de-8451-4b52-9a00-52f1b779f8b2"
          - "csb-aws-redis/large-ha"        = "ca29aa7e-a5a4-43ff-bfb8-8f46f8ec125e"
          - "csb-aws-redis/medium"          = "7b72ae8c-122e-48bd-951f-f32dc1de9367"
          - "csb-aws-redis/medium-ha"       = "8edffa43-209a-431f-bae1-4046b1a6f21a"
          - "csb-aws-redis/small"           = "ccb5a632-3149-4ab0-8d79-90a8fe6297df"
          - "csb-aws-redis/small-ha"        = "fa6a29ae-4f5b-49ba-bccb-73d3b198a8b3"
          - "csb-aws-s3-bucket/private"     = "7c72ab66-9f01-4579-8fdd-4db6240a4057"
          - "csb-aws-s3-bucket/public-read" = "4763a82b-b602-41d6-bc4d-6b04984556df"
        } -> (known after apply)
      ~ services                         = {
          - "csb-aws-dynamodb"   = "acfd6399-989f-4066-8c8d-62f838149e07"
          - "csb-aws-mysql"      = "5bd4b158-8ffb-4bab-a608-0988e64c9980"
          - "csb-aws-postgresql" = "a20c5720-5d35-4d31-8a0a-fe5233c4e59a"
          - "csb-aws-redis"      = "b285892f-f17a-497f-aca0-9ce47e7de3b4"
          - "csb-aws-s3-bucket"  = "489b955e-594f-4861-b56d-852e45054c60"
        } -> (known after apply)
      ~ space                            = "eab3d327-7d9f-423b-9838-753c26fdb5a0" -> (known after apply) # forces replacement
      ~ url                              = "https://ssb-aws-gsa-datagov-management.app.cloud.gov" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.broker_aws.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/management"] must be replaced
-/+ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_hash                     = "53HUIGos3LnoL6VoQubUuNGmNJw=" -> (known after apply)
      ~ id                               = "************************************" -> (known after apply)
        name                             = "ssb-aws-gsa-datagov-management"
      ~ service_plans                    = {
          - "csb-aws-dynamodb/ondemand"     = "830c492c-ff66-4937-be21-aaeabd82f074"
          - "csb-aws-dynamodb/provisioned"  = "5b96b3b0-ba63-461b-b948-a44c4d165003"
          - "csb-aws-mysql/large"           = "c2c57cfa-da7d-4e4d-b5f5-ce8bc6008ff2"
          - "csb-aws-mysql/medium"          = "cd07b0ab-766d-4bc9-a1c3-0eadbab92cc8"
          - "csb-aws-mysql/small"           = "4461d9e5-b1ab-45b7-a27d-2f09c2dcf5be"
          - "csb-aws-postgresql/large"      = "78ab9f8e-b5fc-490a-b469-bfa43bedeec8"
          - "csb-aws-postgresql/medium"     = "ac3bd555-a9c1-4452-83a0-e209ad14dbe7"
          - "csb-aws-postgresql/small"      = "d96640b4-c959-41f2-9263-943eddb24e42"
          - "csb-aws-postgresql/subsume"    = "efbca253-e836-48e1-acd7-050125f62e1e"
          - "csb-aws-redis/large"           = "00d41885-26eb-44e4-8f07-d197acc1f465"
          - "csb-aws-redis/large-ha"        = "05ff62ba-b957-42b2-86bf-9400a85efd47"
          - "csb-aws-redis/medium"          = "7bea4548-dd0e-41eb-99ee-eea5c057818d"
          - "csb-aws-redis/medium-ha"       = "e6add892-1702-4624-b210-04d2380781c6"
          - "csb-aws-redis/small"           = "a0648f22-1ef8-46a4-af8a-e6a1a6baf565"
          - "csb-aws-redis/small-ha"        = "a3af1fdd-8e46-48ce-bb3b-f3e0cfdcc04c"
          - "csb-aws-s3-bucket/private"     = "06f444c7-0af3-4d78-8cf6-4fcd64416b21"
          - "csb-aws-s3-bucket/public-read" = "cea3c9dc-5ee4-4db1-9dd5-eabdc5c8089b"
        } -> (known after apply)
      ~ services                         = {
          - "csb-aws-dynamodb"   = "636416b5-9ce7-4fea-abf1-a57ba41c8fed"
          - "csb-aws-mysql"      = "823ed7f5-6b40-4150-a499-4666f58b368e"
          - "csb-aws-postgresql" = "052d8ec6-ea58-42de-b414-830b84aa45d9"
          - "csb-aws-redis"      = "ab77463f-aad9-473b-acd9-a1032775ca72"
          - "csb-aws-s3-bucket"  = "b32b5908-aad2-46c1-800f-82765d6fc2ce"
        } -> (known after apply)
      ~ space                            = "9a1db116-0180-42be-8ffa-7944dcf6bf50" -> (known after apply) # forces replacement
      ~ url                              = "https://ssb-aws-gsa-datagov-management.app.cloud.gov" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.broker_aws.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/prod"] must be replaced
-/+ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_hash                     = "53HUIGos3LnoL6VoQubUuNGmNJw=" -> (known after apply)
      ~ id                               = "************************************" -> (known after apply)
        name                             = "ssb-aws-gsa-datagov-prod"
      ~ service_plans                    = {
          - "csb-aws-dynamodb/ondemand"     = "543cf97d-39a8-4e72-8b35-a862f7ffd626"
          - "csb-aws-dynamodb/provisioned"  = "150b462e-51a2-4f6e-bf72-8744d48c659d"
          - "csb-aws-mysql/large"           = "43175f4f-dabf-4798-85df-9d37121bef78"
          - "csb-aws-mysql/medium"          = "2dfaef0c-88a4-451a-83ce-02acd151ec58"
          - "csb-aws-mysql/small"           = "16343c34-767d-4159-8986-3eb79b98d7bb"
          - "csb-aws-postgresql/large"      = "603eb1c1-7138-4f4b-ac53-8f0ee98f21da"
          - "csb-aws-postgresql/medium"     = "e69ab386-b27e-4560-977e-455ecbc6159c"
          - "csb-aws-postgresql/small"      = "5722817a-6f44-4bcc-8663-91b15811c205"
          - "csb-aws-postgresql/subsume"    = "156632a4-43c0-487b-88e3-32a03fe0109c"
          - "csb-aws-redis/large"           = "a8ee6edd-4f33-4e09-8294-a43184aa27d1"
          - "csb-aws-redis/large-ha"        = "58220d0c-06c5-4fd8-9e08-e591fc38aba0"
          - "csb-aws-redis/medium"          = "0fdef726-0ff2-44f5-b913-2709c81f9aa9"
          - "csb-aws-redis/medium-ha"       = "86b5601b-5f84-4be4-b464-4a06ce136ae4"
          - "csb-aws-redis/small"           = "e67f4539-558c-401f-822b-db55a9d5f6a0"
          - "csb-aws-redis/small-ha"        = "0a752065-47d5-40e6-9d6d-8f8d2fb7041b"
          - "csb-aws-s3-bucket/private"     = "36d402af-88e5-4697-9f0b-07f59632c62f"
          - "csb-aws-s3-bucket/public-read" = "4b06e35b-639d-4b6a-88e0-92f11dc3257e"
        } -> (known after apply)
      ~ services                         = {
          - "csb-aws-dynamodb"   = "7ab477d8-ac6f-4e3b-99cc-6d93e40f9dcb"
          - "csb-aws-mysql"      = "70b77958-99a5-4954-b65f-cdfcb04f78ed"
          - "csb-aws-postgresql" = "14c0546b-4c35-42b5-96f3-1b916f00461c"
          - "csb-aws-redis"      = "870b0de0-03a8-49b3-ac56-92d145047c42"
          - "csb-aws-s3-bucket"  = "d7e4af7e-204e-453e-bf0e-1fa64541a75a"
        } -> (known after apply)
      ~ space                            = "acbabadb-2604-4736-81f7-01288b0371c6" -> (known after apply) # forces replacement
      ~ url                              = "https://ssb-aws-gsa-datagov-management.app.cloud.gov" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.broker_aws.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/staging"] must be replaced
-/+ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_hash                     = "53HUIGos3LnoL6VoQubUuNGmNJw=" -> (known after apply)
      ~ id                               = "************************************" -> (known after apply)
        name                             = "ssb-aws-gsa-datagov-staging"
      ~ service_plans                    = {
          - "csb-aws-dynamodb/ondemand"     = "245556af-fcb3-4bb2-8fe9-a6f2da4365f5"
          - "csb-aws-dynamodb/provisioned"  = "62b3a0f3-266b-4660-9507-3a0ca20312d9"
          - "csb-aws-mysql/large"           = "f3c0196f-64dd-4b0c-8ea0-70a85b85112c"
          - "csb-aws-mysql/medium"          = "2f8adef5-cbd6-4ae9-a7b4-e8901bab8bd8"
          - "csb-aws-mysql/small"           = "fee4490d-46f7-446a-8554-1ee3546a6073"
          - "csb-aws-postgresql/large"      = "10ffe156-64af-4f08-8388-3f32f078abb4"
          - "csb-aws-postgresql/medium"     = "016b9a7f-cc0e-43b4-8540-a4e3ef9f8be2"
          - "csb-aws-postgresql/small"      = "5e088a94-db93-46c3-a804-de450e849127"
          - "csb-aws-postgresql/subsume"    = "38ddb626-fb25-4545-8b5e-7ef38ea5319d"
          - "csb-aws-redis/large"           = "f9b6bde0-87e0-4378-a789-2bbd13b3f8d8"
          - "csb-aws-redis/large-ha"        = "a66f707e-d390-422b-90e8-75ac40574060"
          - "csb-aws-redis/medium"          = "15b86a68-34fe-4d13-867a-7a485a0436b3"
          - "csb-aws-redis/medium-ha"       = "35afe918-3921-43d0-8dd5-7c509b6178b2"
          - "csb-aws-redis/small"           = "85f14d95-4360-411e-bc3f-6537d1406108"
          - "csb-aws-redis/small-ha"        = "55c43b47-dc68-4ad5-bacc-a8f68f05cafc"
          - "csb-aws-s3-bucket/private"     = "a04e0a3b-f61f-46e8-922e-a15f6f8cb843"
          - "csb-aws-s3-bucket/public-read" = "6a0a43c2-e5d5-45f7-a6c3-99ab1c7716d1"
        } -> (known after apply)
      ~ services                         = {
          - "csb-aws-dynamodb"   = "450ae8bd-fee2-4c76-be6d-61519ec18dd8"
          - "csb-aws-mysql"      = "68d52a97-4d66-45b7-9172-53a9273631eb"
          - "csb-aws-postgresql" = "f86f6081-28a2-4178-9ad0-200b28a3f618"
          - "csb-aws-redis"      = "1ed17f63-ff1c-4860-a781-006d61743f79"
          - "csb-aws-s3-bucket"  = "e042f8f2-4e60-41b1-af44-812fc78895db"
        } -> (known after apply)
      ~ space                            = "3e692cdd-6d26-41ea-9698-04903dc3f742" -> (known after apply) # forces replacement
      ~ url                              = "https://ssb-aws-gsa-datagov-management.app.cloud.gov" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.broker_aws.cloudfoundry_service_instance.db must be replaced
-/+ resource "cloudfoundry_service_instance" "db" {
      ~ id                             = "************************************" -> (known after apply)
        name                           = "ssb-aws-db"
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      ~ service_plan                   = "3a8e624f-ba5a-4435-8fa4-ee955b103bae" -> (known after apply)
      ~ space                          = "9a1db116-0180-42be-8ffa-7944dcf6bf50" -> (known after apply) # forces replacement
        tags                           = [
            "mysql",
        ]
        # (1 unchanged attribute hidden)
    }

  # module.broker_eks.data.archive_file.app_zip will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "app_zip"  {
      ~ id                  = "****************************************" -> (known after apply)
      ~ output_base64sha256 = "CLIecUHXBm4hr3cFUrklfEt6AWaJj8S1LuoZ63p0lQ0=" -> (known after apply)
      ~ output_md5          = "88ae6fe77d3f3826f32ae2f80e2148a3" -> (known after apply)
      ~ output_sha          = "0c13fdaa9be0ee57f5141dab24a9feeeac501493" -> (known after apply)
      ~ output_size         = 430802110 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.broker_eks.data.cloudfoundry_domain.apps will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_domain" "apps"  {
      ~ domain     = "cloud.gov" -> (known after apply)
      ~ id         = "************************************" -> (known after apply)
      ~ internal   = false -> (known after apply)
      ~ name       = "app.cloud.gov" -> (known after apply)
      + org        = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.broker_eks.data.cloudfoundry_service.rds will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_service" "rds"  {
      ~ id                  = "************************************" -> (known after apply)
        name                = "aws-rds"
      ~ service_broker_name = "aws-broker" -> (known after apply)
      ~ service_plans       = {
          - "large-gp-mysql"            = "399ebbb8-ab37-4883-bb7b-0467e66aa8f0"
          - "large-gp-mysql-redundant"  = "3cfd191c-809a-40b1-93c7-37f2f07ec151"
          - "large-gp-psql"             = "639ae8c5-7605-476d-ae55-cfc58f46c6d7"
          - "large-gp-psql-redundant"   = "7eab29c9-e690-4c98-9f78-07cde05b2904"
          - "medium-gp-mysql"           = "f2d7b4af-16e5-4504-8cf9-c1be5d3c81bc"
          - "medium-gp-mysql-redundant" = "f6e176ec-d093-42f7-80e8-2bbacbab450d"
          - "medium-gp-psql"            = "815c6069-289a-4444-ba99-40f0fa03a8f5"
          - "medium-gp-psql-redundant"  = "c1ddc2d6-983b-4ced-9995-064d9dde07aa"
          - "medium-mysql"              = "adf004d9-54b6-40e8-ae6a-56ee985a646c"
          - "medium-mysql-redundant"    = "8bfe6ea3-d8b1-4495-8b4c-5aba9c529f4c"
          - "medium-oracle-se2"         = "601b6c2b-2bac-42a0-84c4-4cb841c34deb"
          - "medium-psql"               = "d8af8c96-8cfd-455f-8660-35a029fec110"
          - "medium-psql-redundant"     = "2fb989d0-4097-4726-9877-88c44fa7a622"
          - "micro-psql"                = "5ed9f319-4c75-4851-9885-598a96b7febc"
          - "micro-psql-redundant"      = "ad7461b3-cb73-4859-a660-477993f85f6f"
          - "shared-mysql"              = "3a8e624f-ba5a-4435-8fa4-ee955b103bae"
          - "shared-psql"               = "64a259ed-01ab-4cdb-ace3-14fc7bde4ab6"
          - "small-mysql"               = "88663dbc-92c9-4b40-9f07-fb4788436fc5"
          - "small-mysql-redundant"     = "4b9e5bb1-d0d3-4c24-8542-e377cbb85aed"
          - "small-psql"                = "903c65ce-6c2b-420f-ad7d-a94ac4d52e93"
          - "small-psql-redundant"      = "731eb930-81ea-4a03-82f2-a187d8339d14"
          - "xlarge-gp-mysql"           = "1f44135c-64a8-44fc-bc61-539f126cdb78"
          - "xlarge-gp-mysql-redundant" = "2ed298b8-a7b5-400a-b2f1-c8198423c861"
          - "xlarge-gp-psql"            = "0fd6a750-0860-4c48-a5ea-fdce04500e23"
          - "xlarge-gp-psql-redundant"  = "58b899e8-eb36-441f-b406-d2f5b1e49c00"
        } -> (known after apply)
    }

  # module.broker_eks.data.cloudfoundry_space.broker_space will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "broker_space"  {
      - annotations = {} -> null
      ~ id          = "************************************" -> (known after apply)
      - labels      = {} -> null
        name        = "management"
      ~ org         = "90047c5d-337f-4802-bd48-2149a4265040" -> (known after apply)
      + quota       = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.broker_eks.data.cloudfoundry_space.spaces["gsa-datagov/development"] will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "spaces"  {
      - annotations = {} -> null
      ~ id          = "************************************" -> (known after apply)
      - labels      = {} -> null
        name        = "development"
      ~ org         = "90047c5d-337f-4802-bd48-2149a4265040" -> (known after apply)
      + quota       = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.broker_eks.data.cloudfoundry_space.spaces["gsa-datagov/management"] will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "spaces"  {
      - annotations = {} -> null
      ~ id          = "************************************" -> (known after apply)
      - labels      = {} -> null
        name        = "management"
      ~ org         = "90047c5d-337f-4802-bd48-2149a4265040" -> (known after apply)
      + quota       = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.broker_eks.data.cloudfoundry_space.spaces["gsa-datagov/prod"] will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "spaces"  {
      - annotations = {} -> null
      ~ id          = "************************************" -> (known after apply)
      - labels      = {} -> null
        name        = "prod"
      ~ org         = "90047c5d-337f-4802-bd48-2149a4265040" -> (known after apply)
      + quota       = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.broker_eks.data.cloudfoundry_space.spaces["gsa-datagov/staging"] will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "spaces"  {
      - annotations = {} -> null
      ~ id          = "************************************" -> (known after apply)
      - labels      = {} -> null
        name        = "staging"
      ~ org         = "90047c5d-337f-4802-bd48-2149a4265040" -> (known after apply)
      + quota       = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.broker_eks.cloudfoundry_app.ssb must be replaced
-/+ resource "cloudfoundry_app" "ssb" {
      ~ environment                = (sensitive value)
      + health_check_http_endpoint = (known after apply)
      ~ health_check_timeout       = 0 -> (known after apply)
      ~ id                         = "************************************" -> (known after apply)
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-eks"
      ~ ports                      = [
          - 8080,
        ] -> (known after apply)
      ~ source_code_hash           = "CLIecUHXBm4hr3cFUrklfEt6AWaJj8S1LuoZ63p0lQ0=" -> (known after apply)
      ~ space                      = "9a1db116-0180-42be-8ffa-7944dcf6bf50" -> (known after apply) # forces replacement
      ~ stack                      = "ad34309f-ab24-4c3d-9ad1-eb0da8378bd4" -> (known after apply)
        # (11 unchanged attributes hidden)

      - routes {
          - port  = 8080 -> null
          - route = "47d6d9c4-3b7e-49b3-85f4-c728dc1b8a9e" -> null
        }
      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }

      ~ service_binding {
          - params           = (sensitive value)
          ~ service_instance = "aca65a42-0575-44a5-87f9-67eed619de57" -> (known after apply)
        }
    }

  # module.broker_eks.cloudfoundry_route.ssb_uri must be replaced
-/+ resource "cloudfoundry_route" "ssb_uri" {
      ~ domain   = "50ba3f69-cd54-4963-9172-14f3334b479e" -> (known after apply) # forces replacement
      ~ endpoint = "ssb-eks-gsa-datagov-management.app.cloud.gov" -> (known after apply)
      ~ id       = "************************************" -> (known after apply)
      + port     = (known after apply)
      ~ space    = "9a1db116-0180-42be-8ffa-7944dcf6bf50" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.broker_eks.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/development"] must be replaced
-/+ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_hash                     = "jAV_jEp-8QsKnQDfps-yPPwOoKw=" -> (known after apply)
      ~ id                               = "************************************" -> (known after apply)
        name                             = "ssb-eks-gsa-datagov-development"
      ~ service_plans                    = {
          - "aws-eks-service/raw" = "f0554847-37f0-4f4d-b5f2-d379232aef38"
        } -> (known after apply)
      ~ services                         = {
          - "aws-eks-service" = "e892da36-e652-455e-bf2c-370ae1900ae1"
        } -> (known after apply)
      ~ space                            = "eab3d327-7d9f-423b-9838-753c26fdb5a0" -> (known after apply) # forces replacement
      ~ url                              = "https://ssb-eks-gsa-datagov-management.app.cloud.gov" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.broker_eks.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/management"] must be replaced
-/+ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_hash                     = "jAV_jEp-8QsKnQDfps-yPPwOoKw=" -> (known after apply)
      ~ id                               = "************************************" -> (known after apply)
        name                             = "ssb-eks-gsa-datagov-management"
      ~ service_plans                    = {
          - "aws-eks-service/raw" = "5e907692-7298-420c-9464-4a79f61061d7"
        } -> (known after apply)
      ~ services                         = {
          - "aws-eks-service" = "e1d1476e-c272-482d-bb00-2a2a0413ed5e"
        } -> (known after apply)
      ~ space                            = "9a1db116-0180-42be-8ffa-7944dcf6bf50" -> (known after apply) # forces replacement
      ~ url                              = "https://ssb-eks-gsa-datagov-management.app.cloud.gov" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.broker_eks.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/prod"] must be replaced
-/+ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_hash                     = "jAV_jEp-8QsKnQDfps-yPPwOoKw=" -> (known after apply)
      ~ id                               = "************************************" -> (known after apply)
        name                             = "ssb-eks-gsa-datagov-prod"
      ~ service_plans                    = {
          - "aws-eks-service/raw" = "7a771f1c-8c06-4a18-a60e-ce6bf55469d9"
        } -> (known after apply)
      ~ services                         = {
          - "aws-eks-service" = "f09d185e-763c-40c9-963b-328d8fd330be"
        } -> (known after apply)
      ~ space                            = "acbabadb-2604-4736-81f7-01288b0371c6" -> (known after apply) # forces replacement
      ~ url                              = "https://ssb-eks-gsa-datagov-management.app.cloud.gov" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.broker_eks.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/staging"] must be replaced
-/+ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_hash                     = "jAV_jEp-8QsKnQDfps-yPPwOoKw=" -> (known after apply)
      ~ id                               = "************************************" -> (known after apply)
        name                             = "ssb-eks-gsa-datagov-staging"
      ~ service_plans                    = {
          - "aws-eks-service/raw" = "5c2eb453-cf27-458a-b3af-eac7038b9d8e"
        } -> (known after apply)
      ~ services                         = {
          - "aws-eks-service" = "7e44aa6d-4f0e-4410-9685-4b8205490466"
        } -> (known after apply)
      ~ space                            = "3e692cdd-6d26-41ea-9698-04903dc3f742" -> (known after apply) # forces replacement
      ~ url                              = "https://ssb-eks-gsa-datagov-management.app.cloud.gov" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.broker_eks.cloudfoundry_service_instance.db must be replaced
-/+ resource "cloudfoundry_service_instance" "db" {
      ~ id                             = "************************************" -> (known after apply)
        name                           = "ssb-eks-db"
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      ~ service_plan                   = "3a8e624f-ba5a-4435-8fa4-ee955b103bae" -> (known after apply)
      ~ space                          = "9a1db116-0180-42be-8ffa-7944dcf6bf50" -> (known after apply) # forces replacement
        tags                           = [
            "mysql",
        ]
        # (1 unchanged attribute hidden)
    }

Plan: 15 to add, 1 to change, 15 to destroy.

Changes to Outputs:
  ~ route53_zone_nameservers = [
      - [
          - "ns-1147.awsdns-15.org",
          - "ns-1786.awsdns-31.co.uk",
          - "ns-28.awsdns-03.com",
          - "ns-658.awsdns-18.net",
        ],
      + (known after apply),
    ]
```
</details>

Plan generated in [plan #58](https://github.com/GSA/datagov-ssb/actions/runs/743389137)